# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример: *

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

a = int(input("Введите трехзначное число: "))
sum = 0
while a > 0:
    b = a % 10
    sum = sum + b
    a = a // 10
print("Сумму цифр: ", sum)

# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример: *

# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

sum = int(input("Введите количество журавликов, кратное 6: "))
x = sum // 6

print("Петя: ", x)
print("Сережа: ", x)
print("Катя: ", x*4)

# *Задача решается, только при условии, что вводимое число кратно 6...

# Задача 6: Вы пользуетесь общественным транспортом? 
# Вероятно, вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером, 
# где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5 = 9+1+6. 
# Вам требуется написать программу, которая проверяет счастливость билета.

# *Пример: *

# 385916 -> yes
# 123456 -> no

a = int(input("Введите шестизначное число: "))
a1 = a // 100000
a2 = (a % 100000) // 10000
a3 = (a % 10000) // 1000
a4 = (a % 1000) // 100
a5 = (a % 100) // 10
a6 = a % 10
if a1 + a2 + a3 == a4 + a5 + a6:
    print("yes")
else:
    print('no')

# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, 
# если разрешается сделать один разлом по прямой между дольками(то есть разломить шоколадку на два прямоугольника).

# *Пример: *

# 3 2 4 -> yes
# 3 2 1 -> no

a = int(input("Введите число: "))
b = int(input("Введите число: "))
c = int(input("Введите число: "))
if c <= b * a and (c % a == 0 or c % b == 0):
    print('yes')
else:
    print('no')
