# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# *Пример: *
# 5
# 1 2 3 4 5
# 3
# -> 1

# import random
# length_mass = int(input('Введите длину массива: '))
# my_number = int(input('Введите число для поиска: '))
# random_mass = [random.randint(1, 10) for _ in range(length_mass)]
# print(f'Массив: {random_mass}')
# print(f'Число "{my_number}" в массиве = {random_mass.count(my_number)}')


# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# *Пример: *
# 5
# 1 2 3 4 5
# 6
# -> 5

# import random
# length_mass = int(input('Введите длину массива: '))
# my_number = int(input('Введите число для поиска: '))
# random_mass = [random.randint(1, 10) for _ in range(length_mass)]
# min_delta = max(random_mass)

# for index in range(length_mass):
#     if abs(my_number - random_mass[index]) < min_delta:
#         min_delta = abs(my_number - random_mass[index])
#         search_number = random_mass[index]

# print(f'Массив: {random_mass}')
# print(f'Число = {search_number}')

# *Задача 20: * В настольной игре Скрабл(Scrabble) каждая буква имеет определенную ценность. 
# В случае с английским алфавитом очки распределяются так:
#  A, E, I, O, U, L, N, S, T, R – 1 очко
# D, G – 2 очка
# B, C, M, P – 3 очка
# F, H, V, W, Y – 4 очка
# K – 5 очков
# J, X – 8 очков
# Q, Z – 10 очков. 
# А русские буквы оцениваются так: 
# А, В, Е, И, Н, О, Р, С, Т – 1 очко
# Д, К, Л, М, П, У – 2 очка
# Б, Г, Ё, Ь, Я – 3 очка
# Й, Ы – 4 очка
# Ж, З, Х, Ц, Ч – 5 очков
# Ш, Э, Ю – 8 очков
# Ф, Щ, Ъ – 10 очков. Напишите программу, которая вычисляет стоимость введенного пользователем слова. Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.
# *Пример: *
# ноутбук
# 12

my_dict = {1: 'A, E, I, O, U, L, N, S, T, R, А, В, Е, И, Н, О, Р, С, Т' ,
           2: 'D, G, Д, К, Л, М, П, У' ,
           3: 'Б, Г, Ё, Ь, Я, B, C, M, P' ,
           4: 'Й, Ы, F, H, V, W, Y' ,
           5: 'K, Ж, З, Х, Ц, Ч' ,
           8: 'Ш, Э, Ю, J, X' ,
           10: 'Ф, Щ, Ъ, Q, Z'}
my_word = list(input('Введите слово: '))
count = 0
for elem in my_word:
    for key, value in my_dict.items():
        if elem.upper() in value:
            count += key
print(f'Word value: {count}')
