# Задача 22: Даны два неупорядоченных набора целых чисел(может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во элементов второго множества. 
# Затем пользователь вводит сами элементы множеств.

# import random
# length_list_1 = int(input('Введите длину первого множества чисел: '))
# length_list_2 = int(input('Введите длину второго множества чисел: '))
# list_1 = [random.randint(1, 20) for _ in range(length_list_1)]
# list_2 = [random.randint(1, 20) for _ in range(length_list_2)]
# print(f'Первое множество: {list_1}')
# print(f'Второе множество: {list_1}')
# print(f'Множество из пересекаемых чисел: {sorted(set(list_1).intersection(set(list_2)))}')

# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растет на круглой грядке, причем кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло 
# различное число ягод – на i-ом кусте выросло РАНДОМНОЕ колличество ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, 
# которое может собрать за один заход собирающий модуль, 
# находясь перед некоторым кустом заданной во входном файле грядки.

import random
amount_bush = int(input('Введите количество кустов: '))
number_bush = int(input('Введите номер куста: '))
garden_list = [random.randint(1, 10) for _ in range(amount_bush)]
print(f'Грядка/куст: {garden_list}')
if number_bush == 1:
    max_berries = garden_list[-1] + sum(garden_list[:2])
elif number_bush == amount_bush:
    max_berries = sum(garden_list[amount_bush-2:]) + garden_list[0]
else:
    max_berries = sum(garden_list[number_bush-2:number_bush+1])
print(f'Максимальное количество ягод: {max_berries}')