# Задача 26:  Напишите программу, которая на вход принимает два числа A и B, 
# и возводит число А в целую степень B с помощью рекурсии.

# *Пример: *
# A = 3
# B = 5 -> 243 (3⁵)
# A = 2
# B = 3 -> 8

def func_st(a, b):
    if b > 0:
        return a * func_st(a, b - 1)
        return 1
a1 = int(input('Введите число: '))
b1 = int(input('Введите степень: '))
func_st(a1, b1)

# Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. 
# Из всех арифметических операций допускаются только + 1 и - 1. Также нельзя использовать циклы.

# *Пример: *
# 2 2
# 4

a1 = int(input('Введите перове слагаемое: '))
b1 = int(input('Введите второе слагаемое: '))
summa(a1, b1)

def summa(a, b):
    if b > 0:
        return summa(a + 1, b - 1)
    return a